.metadata/.plugins/org.eclipse.core.resources/.history/55/e06d1cb70a12001d1553d49b19b5b73c

package testscript;

import io.restassured.response.Response;
import static io.restassured.RestAssured.*;

import io.restassured.http.ContentType;


public class APIPostTesting {
	
	public static void main(String args[]) throws Exception {
		
		PostcallNumbertoWords();
		
		
	}
	
	public static void PostcallNumbertoWords(int num){
		
		Response res = given()
							.contentType(ContentType.XML) //the body is XML 
							.header("Content-Type", "text/xml; charset=utf-8")
							.accept(ContentType.XML) //response need to be XML
							.body("<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n"
									+ "  <soap:Body>\r\n"
									+ "    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n"
									+ "      <ubiNum>"+num+"</ubiNum>\r\n"
									+ "    </NumberToWords>\r\n"
									+ "  </soap:Body>\r\n"
									+ "</soap:Envelope>")
							.when()
							.post("https://www.dataaccess.com/webservicesserver/NumberConversion.wso");
		
		System.out.println(res.statusCode());
		
		System.out.println(res.body().asString());
		
	}

}
